dobbyzzipeng/9axisdmp/STM32_MPU9250_DMP -v1/User/eMPL/inv_mpu.c
        /* Enable motion interrupt (MPU6500 version). */
        data[0] = BITS_WOM_EN;
        if (i2c_write(st.hw->addr, st.reg->accel_intel, 1, data))
            goto lp_int_restore;

        /* Enable cycle mode. */
        data[0] = BIT_LPA_CYCLE;
        if (i2c_write(st.hw->addr, st.reg->pwr_mgmt_1, 1, data))
            goto lp_int_restore;

        /* Enable interrupt. */
        data[0] = BIT_MOT_INT_EN;
        if (i2c_write(st.hw->addr, st.reg->int_enable, 1, data))
            goto lp_int_restore;

        st.chip_cfg.int_motion_only = 1;
        return 0;
#endif
    } else {
        /* Don't "restore" the previous state if no state has been saved. */
        int ii;
        char *cache_ptr = (char*)&st.chip_cfg.cache;
        for (ii = 0; ii < sizeof(st.chip_cfg.cache); ii++) {
            if (cache_ptr[ii] != 0)
                goto lp_int_restore;
        }
        /* If we reach this point, motion interrupt mode hasn't been used yet. */
        return -1;
    }
lp_int_restore:
    /* Set to invalid values to ensure no I2C writes are skipped. */
    st.chip_cfg.gyro_fsr = 0xFF;
    st.chip_cfg.accel_fsr = 0xFF;
    st.chip_cfg.lpf = 0xFF;
    st.chip_cfg.sample_rate = 0xFFFF;
    st.chip_cfg.sensors = 0xFF;
    st.chip_cfg.fifo_enable = 0xFF;
    st.chip_cfg.clk_src = INV_CLK_PLL;
    mpu_set_sensors(st.chip_cfg.cache.sensors_on);
    mpu_set_gyro_fsr(st.chip_cfg.cache.gyro_fsr);
    mpu_set_accel_fsr(st.chip_cfg.cache.accel_fsr);
    mpu_set_lpf(st.chip_cfg.cache.lpf);
    mpu_set_sample_rate(st.chip_cfg.cache.sample_rate);
    mpu_configure_fifo(st.chip_cfg.cache.fifo_sensors);

    if (st.chip_cfg.cache.dmp_on)
        mpu_set_dmp_state(1);

#ifdef MPU6500
    /* Disable motion interrupt (MPU6500 version). */
    data[0] = 0;
    if (i2c_write(st.hw->addr, st.reg->accel_intel, 1, data))
        goto lp_int_restore;
#endif

    st.chip_cfg.int_motion_only = 0;
    return 0;
}

void mpu_dmp_init(void)
{
	uint8_t result=0;
    result = mpu_init();
    if(!result)   //返回0代表初始化成功
    {
        PrintChar("mpu initialization complete......\n ");
        
        //mpu_set_sensor
        if(!mpu_set_sensors(INV_XYZ_GYRO | INV_XYZ_ACCEL))
        {
            PrintChar("mpu_set_sensor complete ......\n");
        }
        else
        {
            PrintChar("mpu_set_sensor come across error ......\n");
        }
        
        //mpu_configure_fifo
        if(!mpu_configure_fifo(INV_XYZ_GYRO | INV_XYZ_ACCEL))
        {
            PrintChar("mpu_configure_fifo complete ......\n");
        }
        else
        {
            PrintChar("mpu_configure_fifo come across error ......\n");
        }
        
        //mpu_set_sample_rate
        if(!mpu_set_sample_rate(DEFAULT_SAMPLE_HZ))
        {
            PrintChar("mpu_set_sample_rate complete ......\n");
        }
        else
        {
            PrintChar("mpu_set_sample_rate error ......\n");
        }
        
        //dmp_load_motion_driver_firmvare
        if(!dmp_load_motion_driver_firmware())
        {
            PrintChar("dmp_load_motion_driver_firmware complete ......\n");
        }
        else
        {
            PrintChar("dmp_load_motion_driver_firmware come across error ......\n");
        }
        
        //dmp_set_orientation
        if(!dmp_set_orientation(inv_orientation_matrix_to_scalar(gyro_orientation)))
        {
            PrintChar("dmp_set_orientation complete ......\n");
        }
        else
        {
            PrintChar("dmp_set_orientation come across error ......\n");
        }
        
        //dmp_enable_feature
        if(!dmp_enable_feature(DMP_FEATURE_6X_LP_QUAT /*| DMP_FEATURE_TAP |
            DMP_FEATURE_ANDROID_ORIENT */| DMP_FEATURE_SEND_RAW_ACCEL | DMP_FEATURE_SEND_CAL_GYRO |
            DMP_FEATURE_GYRO_CAL))
        {
            PrintChar("dmp_enable_feature complete ......\n");
        }
        else
        {
            PrintChar("dmp_enable_feature come across error ......\n");
        }
        
        //dmp_set_fifo_rate
        if(!dmp_set_fifo_rate(DEFAULT_MPU_HZ))
        {
            PrintChar("dmp_set_fifo_rate complete ......\n");
        }
        else
        {
            PrintChar("dmp_set_fifo_rate come across error ......\n");
        }
        
        run_self_test();
        
        if(!mpu_set_dmp_state(1))
        {
            PrintChar("mpu_set_dmp_state complete ......\n");
        }
        else
        {
            PrintChar("mpu_set_dmp_state come across error ......\n");
        }
        
    }
}

void dmp_get_angle(float *pit,float *rol,float *yaw)
{
	//float Yaw,Roll,Pitch;
    dmp_read_fifo(_gyro, _accel, quat, &sensor_timestamp, &_sensors, &_more);	 
    /* Gyro and accel data are written to the FIFO by the DMP in chip
     * frame and hardware units. This behavior is convenient because it
     * keeps the gyro and accel outputs of dmp_read_fifo and
     * mpu_read_fifo consistent.
     */
     /*     if (sensors & INV_XYZ_GYRO )
      send_packet(PACKET_TYPE_GYRO, gyro);
      if (sensors & INV_XYZ_ACCEL)
      send_packet(PACKET_TYPE_ACCEL, accel); */
      /* Unlike gyro and accel, quaternions are written to the FIFO in
      * the body frame, q30. The orientation is set by the scalar passed
      * to dmp_set_orientation during initialization.
      */
		/*四元数解姿态*/
      if (_sensors & INV_WXYZ_QUAT )
      {
         q0 = quat[0] / q30;
         q1 = quat[1] / q30;
         q2 = quat[2] / q30;
         q3 = quat[3] / q30;
            
         *pit  = asin(-2 * q1 * q3 + 2 * q0* q2)* 57.3f; // pitch
         *rol  = atan2(2 * q2 * q3 + 2 * q0 * q1, -2 * q1 * q1 - 2 * q2* q2 + 1)* 57.3f; // roll
         *yaw  = atan2(2*(q1*q2 + q0*q3),q0*q0+q1*q1-q2*q2-q3*q3) * 57.3f;
      }

      if(_sensors & INV_XYZ_GYRO)
      {}
      if(_sensors & INV_XYZ_ACCEL)
      {}
}
/**
 *  @}
 */

